7767517
97 103
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Padding                  reflectpad2d_85          1 1 in1 2 0=3 1=3 2=3 3=3 4=2
Convolution              convrelu_0               1 1 2 3 0=32 1=7 11=7 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4704 9=1
BatchNorm                bn_8                     1 1 3 4 0=32 1=1.000000e-05
Padding                  reflectpad2d_86          1 1 4 5 0=1 1=1 2=1 3=1 4=2
Convolution              convrelu_1               1 1 5 6 0=64 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=18432 9=1
BatchNorm                bn_9                     1 1 6 7 0=64 1=1.000000e-05
Padding                  reflectpad2d_87          1 1 7 8 0=1 1=1 2=1 3=1 4=2
Convolution              convrelu_2               1 1 8 9 0=128 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=73728 9=1
BatchNorm                bn_10                    1 1 9 10 0=128 1=1.000000e-05
Padding                  reflectpad2d_88          1 1 10 11 0=1 1=1 2=1 3=1 4=2
Convolution              convrelu_3               1 1 11 12 0=256 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=294912 9=1
BatchNorm                bn_11                    1 1 12 13 0=256 1=1.000000e-05
Padding                  reflectpad2d_89          1 1 13 14 0=1 1=1 2=1 3=1 4=2
Convolution              convrelu_4               1 1 14 15 0=512 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=1179648 9=1
BatchNorm                bn_12                    1 1 15 16 0=512 1=1.000000e-05
Split                    splitncnn_0              1 2 16 17 18
Pooling                  gap_5                    1 1 18 19 0=1 4=1
Reshape                  view_99                  1 1 19 20 0=512
InnerProduct             fcrelu_0                 1 1 20 21 0=128 1=1 2=65536 9=1
InnerProduct             linear_78                1 1 21 22 0=512 1=1 2=65536
BinaryOp                 add_0                    1 1 22 23 0=0 1=1 2=3.000000e+00
Clip                     relu6_97                 1 1 23 24 0=0.000000e+00 1=6.000000e+00
BinaryOp                 div_1                    1 1 24 25 0=3 1=1 2=6.000000e+00
Reshape                  view_100                 1 1 25 26 0=1 1=1 2=512
BinaryOp                 mul_2                    2 1 17 26 27 0=2
Convolution              convrelu_5               1 1 in0 28 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 9=2
BatchNorm                bn_13                    1 1 28 29 0=32 1=1.000000e-05
Convolution              convrelu_6               1 1 29 30 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=2
BatchNorm                bn_14                    1 1 30 31 0=32 1=1.000000e-05
Split                    splitncnn_1              1 2 31 32 33
Pooling                  maxpool2d_81             1 1 33 34 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_7               1 1 34 35 0=64 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
BatchNorm                bn_15                    1 1 35 36 0=64 1=1.000000e-05
Convolution              convrelu_8               1 1 36 37 0=64 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
BatchNorm                bn_16                    1 1 37 38 0=64 1=1.000000e-05
Split                    splitncnn_2              1 2 38 39 40
Pooling                  maxpool2d_82             1 1 40 41 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_9               1 1 41 42 0=128 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=2
BatchNorm                bn_17                    1 1 42 43 0=128 1=1.000000e-05
Convolution              convrelu_10              1 1 43 44 0=128 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=2
BatchNorm                bn_18                    1 1 44 45 0=128 1=1.000000e-05
Split                    splitncnn_3              1 2 45 46 47
Pooling                  maxpool2d_83             1 1 47 48 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_11              1 1 48 49 0=256 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
BatchNorm                bn_19                    1 1 49 50 0=256 1=1.000000e-05
Convolution              convrelu_12              1 1 50 51 0=256 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=2
BatchNorm                bn_20                    1 1 51 52 0=256 1=1.000000e-05
Split                    splitncnn_4              1 2 52 53 54
Pooling                  maxpool2d_84             1 1 54 55 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_13              1 1 55 56 0=512 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
BatchNorm                bn_21                    1 1 56 57 0=512 1=1.000000e-05
Convolution              convrelu_14              1 1 57 58 0=512 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=2
BatchNorm                bn_22                    1 1 58 59 0=512 1=1.000000e-05
Split                    splitncnn_5              1 2 59 60 61
Pooling                  gap_6                    1 1 61 62 0=1 4=1
Reshape                  view_101                 1 1 62 63 0=512
InnerProduct             fcrelu_1                 1 1 63 64 0=128 1=1 2=65536 9=1
InnerProduct             linear_80                1 1 64 65 0=512 1=1 2=65536
BinaryOp                 add_3                    1 1 65 66 0=0 1=1 2=3.000000e+00
Clip                     relu6_98                 1 1 66 67 0=0.000000e+00 1=6.000000e+00
BinaryOp                 div_4                    1 1 67 68 0=3 1=1 2=6.000000e+00
Reshape                  view_102                 1 1 68 69 0=1 1=1 2=512
BinaryOp                 mul_5                    2 1 60 69 70 0=2
Pooling                  gap_7                    1 1 27 71 0=1 4=1
Interp                   upsample_0               1 1 71 72 0=2 1=1.600000e+01 2=1.600000e+01 6=0
Concat                   cat_0                    2 1 70 72 73 0=0
Convolution              conv_45                  1 1 73 74 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4718592
Interp                   upsample_1               1 1 74 75 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_46                  1 1 75 76 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648
Concat                   cat_1                    2 1 76 53 77 0=0
Convolution              convrelu_15              1 1 77 78 0=256 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
BatchNorm                bn_23                    1 1 78 79 0=256 1=1.000000e-05
Convolution              convrelu_16              1 1 79 80 0=256 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=2
BatchNorm                bn_24                    1 1 80 81 0=256 1=1.000000e-05
Interp                   upsample_2               1 1 81 82 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_49                  1 1 82 83 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Concat                   cat_2                    2 1 83 46 84 0=0
Convolution              convrelu_17              1 1 84 85 0=128 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
BatchNorm                bn_25                    1 1 85 86 0=128 1=1.000000e-05
Convolution              convrelu_18              1 1 86 87 0=128 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=2
BatchNorm                bn_26                    1 1 87 88 0=128 1=1.000000e-05
Interp                   upsample_3               1 1 88 89 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_52                  1 1 89 90 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Concat                   cat_3                    2 1 90 39 91 0=0
Convolution              convrelu_19              1 1 91 92 0=64 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=2
BatchNorm                bn_27                    1 1 92 93 0=64 1=1.000000e-05
Convolution              convrelu_20              1 1 93 94 0=64 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
BatchNorm                bn_28                    1 1 94 95 0=64 1=1.000000e-05
Interp                   upsample_4               1 1 95 96 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_55                  1 1 96 97 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Concat                   cat_4                    2 1 97 32 98 0=0
Convolution              convrelu_21              1 1 98 99 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
BatchNorm                bn_29                    1 1 99 100 0=32 1=1.000000e-05
Convolution              convrelu_22              1 1 100 101 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=2
Convolution              conv_58                  1 1 101 out0 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=96
